In [6]:
import pandas as pd
import numpy as np

In [2]:
serie = pd.Series([1,2,3,4,5,6,7,8,9])
serie

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [3]:
def es_par(elemento):
    if elemento % 2 == 0:
        return "Par: " + str(elemento)
    else:
        return "Impar: " + str(elemento)
es_par(48)

'Par: 48'

In [4]:
serie.map(es_par)

0    Impar: 1
1      Par: 2
2    Impar: 3
3      Par: 4
4    Impar: 5
5      Par: 6
6    Impar: 7
7      Par: 8
8    Impar: 9
dtype: object

In [8]:
dataframe =pd.DataFrame(np.arange(16).reshape(4,4))
dataframe

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
dataframe.applymap(es_par)

         0          1        2          3
0   Par: 0   Impar: 1   Par: 2   Impar: 3
1   Par: 4   Impar: 5   Par: 6   Impar: 7
2   Par: 8   Impar: 9  Par: 10  Impar: 11
3  Par: 12  Impar: 13  Par: 14  Impar: 15

In [16]:
def es_suma_par(elemento):
    if np.sum(elemento) % 2 == 0:
        return "Suma par: " + str(np.sum(elemento))
    else:
        return "Impar: " + str(np.sum(elemento))

In [20]:
dataframe.apply(es_suma_par, axis=1)

0     Suma par: 6
1    Suma par: 22
2    Suma par: 38
3    Suma par: 54
dtype: object

In [ ]:
# pd.merge(dataframe_1, dataframe_2)
# # pd.merge(dataframe_1, dataframe_2, left_on="columna1, right_on="columna_2, how="outer")
# suffixes=("sufijo_1")
# pd.concat ([dataframe_1, dataframe_2], axis = 1, sort = True)
# pd.concat ([dataframe_1, dataframe_2], axis = 1, join = "inner")

# pd.concat ([dataframe_1, dataframe_2], keys = ["dataset1", "dataset2"], sort = True)
#groupby("AÃ±o")